posts/data-structures-for-sparse-matrix/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Data Structures for Sparse Matrix | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/data-structures-for-sparse-matrix/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../sparse-matrix/" title="Sparse Matrix" type="text/html">
<link rel="next" href="../petsc/" title="PETSc" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="Data Structures for Sparse Matrix">
<meta property="og:url" content="https://chimez.github.io/posts/data-structures-for-sparse-matrix/">
<meta property="og:description" content="稀疏矩阵的数据结构



常见结构


COO: Coordinate or triplet
CSR: Compressed Sparse Row
CSC: Compressed Sparse Column
DIA: Diagonal
BSR: Block Sparse Row





COO: coordinate


也叫做 triplet 格式
最简单和基本的格式，通常用做向其它格式转换的">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-04-19T15:24:09+08:00">
<meta property="article:tag" content="Numerical Algorithm">
<meta property="article:tag" content="Sparse Matrix">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Data Structures for Sparse Matrix</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-04-19T15:24:09+08:00" itemprop="datePublished" title="2021-04-19 15:24">2021-04-19 15:24</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org3bfd918" class="outline-2">
<h2 id="org3bfd918">稀疏矩阵的数据结构</h2>
<div class="outline-text-2" id="text-org3bfd918">
</div>
<div id="outline-container-org2405116" class="outline-3">
<h3 id="org2405116">常见结构</h3>
<div class="outline-text-3" id="text-org2405116">
<ul class="org-ul">
<li>COO: Coordinate or triplet</li>
<li>CSR: Compressed Sparse Row</li>
<li>CSC: Compressed Sparse Column</li>
<li>DIA: Diagonal</li>
<li>BSR: Block Sparse Row</li>
</ul>
</div>
</div>

<div id="outline-container-org10f7b6c" class="outline-3">
<h3 id="org10f7b6c">COO: coordinate</h3>
<div class="outline-text-3" id="text-org10f7b6c">
<ol class="org-ol">
<li>也叫做 triplet 格式</li>
<li>最简单和基本的格式，通常用做向其它格式转换的入门格式</li>
<li>顺序是任意的</li>
<li>保存三列数据：值、行指标、列指标</li>
</ol>
<pre class="example" id="orgcd7966d">
A:
   [[ 1,  0,  0,  2,  0],
    [ 3,  4,  0,  5,  0],
    [ 6,  0,  7,  8,  9],
    [ 0,  0, 10, 11,  0],
    [ 0,  0,  0,  0, 12]]

data:   [1, 3, 6, 4, 7, 10, 2, 5, 8, 11, 9, 12]
row(i): [0, 0, 1, 1, 1,  2, 2, 2, 2,  3, 3,  4]
col(j): [0, 3, 0, 1, 3,  0, 2, 3, 4,  2, 3,  4]

A[ i[k], j[k] ] = data[k]
</pre>
</div>
</div>

<div id="outline-container-org33594e8" class="outline-3">
<h3 id="org33594e8">CSR: Compressed Sparse Row</h3>
<div class="outline-text-3" id="text-org33594e8">
<ol class="org-ol">
<li>按行压缩，即coo格式中的数据值、列指标不变，但行指标改成指向这一行开始的列的指标</li>
<li>一般来说，Fortran 里使用这种格式</li>
</ol>
<pre class="example" id="org18c899c">
A:
   [[ 1,  0,  0,  2,  0],
    [ 3,  4,  0,  5,  0],
    [ 6,  0,  7,  8,  9],
    [ 0,  0, 10, 11,  0],
    [ 0,  0,  0,  0, 12]]

data:   [1, 3, 6, 4, 7, 10, 2, 5, 8, 11, 9, 12]
row(i): [0, 2, 5, 9, 11, 12]
col(j): [0, 3, 0, 1, 3,  0, 2, 3, 4,  2, 3,  4]

</pre>
</div>
</div>

<div id="outline-container-orgcd66a16" class="outline-3">
<h3 id="orgcd66a16">CSC: Compressed Sparse Column</h3>
<div class="outline-text-3" id="text-orgcd66a16">
<ol class="org-ol">
<li>按列压缩，与 CSR 类似，不过行列换一下</li>
<li>c 中常用这种格式</li>
</ol>
<pre class="example" id="orgfb05a7b">
A:
   [[ 1,  0,  0,  2,  0],
    [ 3,  4,  0,  5,  0],
    [ 6,  0,  7,  8,  9],
    [ 0,  0, 10, 11,  0],
    [ 0,  0,  0,  0, 12]]

data:   [1, 3, 6, 4, 7, 10, 2, 5, 8, 11, 9, 12]
row(i): [0, 1, 2, 1, 2,  3, 0, 1, 2,  3, 2,  4]
col(j): [0, 3, 4, 6, 10, 12]

</pre>
</div>
</div>

<div id="outline-container-orgadd77f2" class="outline-3">
<h3 id="orgadd77f2">DIA: The Diagonal format</h3>
<div class="outline-text-3" id="text-orgadd77f2">
<ol class="org-ol">
<li>按对角线压缩，保存偏移值，负的偏移忽略头元素，正的偏移忽略尾元素</li>
</ol>
<pre class="example" id="org47d3829">
A:
   [[ 1.,  0.,  2.,  0.,  0.],
    [ 3.,  4.,  0.,  5.,  0.],
    [ 0.,  6.,  7.,  0.,  8.],
    [ 0.,  0.,  9., 10.,  0.],
    [ 0.,  0.,  0., 11., 12.]]

data:
   [[ 3.,  6.,  9., 11., nan],
    [ 1.,  4.,  7., 10., 12.],
    [nan, nan,  2.,  5.,  8.]]

offsets: [-1,  0,  2]

</pre>
</div>
</div>

<div id="outline-container-org7004d68" class="outline-3">
<h3 id="org7004d68">BSR: Block matrices</h3>
<div class="outline-text-3" id="text-org7004d68">
<ol class="org-ol">
<li>类似 CSR，只不过每个行列指的是一个小的矩阵，这些小矩阵大小都相等</li>
</ol>
</div>
</div>

<div id="outline-container-org57f6e61" class="outline-3">
<h3 id="org57f6e61">scipy 格式</h3>
<div class="outline-text-3" id="text-org57f6e61">
<ol class="org-ol">
<li>很容易使用，参考 <a href="https://docs.scipy.org/doc/scipy/reference/sparse.html">scipy - sparse</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgb45ef2f" class="outline-3">
<h3 id="orgb45ef2f">suitesparse 格式</h3>
</div>

<div id="outline-container-org814ec7b" class="outline-3">
<h3 id="org814ec7b">MKL 格式</h3>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/numerical-algorithm/" rel="tag">Numerical Algorithm</a></li>
            <li><a class="tag p-category" href="../../categories/sparse-matrix/" rel="tag">Sparse Matrix</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../sparse-matrix/" rel="prev" title="Sparse Matrix">Previous post</a>
            </li>
            <li class="next">
                <a href="../petsc/" rel="next" title="PETSc">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
